InformationRegisters/СтатусыПерекрестков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СтатусыПерекрестков</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Строительство</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Игрок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Игроки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Перекресток</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Перекрестки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СтатусыПути.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СтатусыПути</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Игрок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Игроки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Путь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пути</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonForms/ФормаХТМЛ/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	ИнициализацияКартинок();
	ИнициализацияМакетов();  
	
	ОбщийМодульСервер.ЗаполнитьЦвета(ЭтотОбъект);
	РаботаСГлавнымМенюСервер.ИнициализацияГлавногоМеню(ЭтотОбъект);
	Элементы.ВсеСтраницы.ТекущаяСтраница = Элементы.СтраницаГлавногоМеню;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализацияКартинок()
	
	ФонЗаморскаяТорговляАдрес = ПоместитьВоВременноеХранилище(БиблиотекаКартинок.ФонЗаморскойТорговли , Новый УникальныйИдентификатор);
	ФонВнутреняяТорговляАдрес = ПоместитьВоВременноеХранилище(БиблиотекаКартинок.ФонВнутреннейТорговли , Новый УникальныйИдентификатор);
	
КонецПроцедуры  

&НаСервере
Процедура ИнициализацияКубиков()
	
	КрасныйКубик = ПоместитьВоВременноеХранилище(БиблиотекаКартинок.КрасныйКубик1 , Новый УникальныйИдентификатор);
	ЖелтыйКубик = ПоместитьВоВременноеХранилище(БиблиотекаКартинок.ЖелтыйКубик1 , Новый УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Процедура ИнициализацияМакетов()
	
	ИнициализацияКартинок();  
	
	МакетГлавногоМеню = ПолучитьОбщийМакет("ГлавноеМеню").ПолучитьТекст();
	МакетИгровогоПоля = ПолучитьОбщийМакет("ИгровоеПоле").ПолучитьТекст();
	
КонецПроцедуры   

//Работа с главным меню

&НаКлиенте
Процедура ГлавноеМенюПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь;
	
	Если ДанныеСобытия.Element.id = "Start" Тогда
		
		Документ =  Элементы.ГлавноеМеню.Документ;
		Цвет = Документ.getElementById("playerColor").value; 
		ЦветИгрока(Цвет);
		РаботаСИгровымПолемКлиент.ИнициализацияИгровогоПоля(ЭтотОбъект);  
		//Элементы.ИгровоеПоле.Документ
		Элементы.ВсеСтраницы.ТекущаяСтраница = Элементы.СтраницаЗаставки;
		
		ИгровоеПолеХТМЛ = МакетИгровогоПоля;  
		
	ИначеЕсли ДанныеСобытия.Element.id = "Avatar" Тогда	
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		Диалог.Фильтр = "Изображения (*.png,*.jpg,*.jpeg)|*.png;*.jpg;*.jpeg";
		
		Если Диалог.Выбрать()= Истина Тогда
			Элементы.ГлавноеМеню.Документ.getElementById("Avatar").src = Диалог.ПолноеИмяФайла;
		КонецЕсли;
		
	ИначеЕсли ДанныеСобытия.Element.id = "Exit" Тогда
		ЗавершитьРаботуСистемы();
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветИгрока(ВыбранныйЦвет)
	
	Если ВыбранныйЦвет = "Красный" Тогда
		МакетИгровогоПоля = СтрЗаменить(МакетИгровогоПоля, "%ВашЦвет%", "red");
		ЦветИгрока = "Красный";
	ИначеЕсли ВыбранныйЦвет = "Синий" Тогда
		МакетИгровогоПоля = СтрЗаменить(МакетИгровогоПоля, "%ВашЦвет%", "blue");
		ЦветИгрока = "Синий";
	ИначеЕсли ВыбранныйЦвет = "Зеленый" Тогда
		МакетИгровогоПоля = СтрЗаменить(МакетИгровогоПоля, "%ВашЦвет%", "green");
		ЦветИгрока = "Зеленый";
	ИначеЕсли ВыбранныйЦвет = "Желтый" Тогда
		МакетИгровогоПоля = СтрЗаменить(МакетИгровогоПоля, "%ВашЦвет%", "yellow");
		ЦветИгрока = "Желтый";
	ИначеЕсли ВыбранныйЦвет = "Коричневый" Тогда
		МакетИгровогоПоля = СтрЗаменить(МакетИгровогоПоля, "%ВашЦвет%", "brown");
		ЦветИгрока = "Коричневый";
	КонецЕсли;
	
	СтрокаДляУдаления = "<div><option value=""" + ВыбранныйЦвет + """>" + ВыбранныйЦвет + "</option></div>";
	ГлавноеМенюХТМЛ = СтрЗаменить(ГлавноеМенюХТМЛ, СтрокаДляУдаления, "");
	
КонецПроцедуры


#Область Работа_с_игровым_полем
//Работа с игровым полем
&НаКлиенте
Процедура ИгровоеПолеПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Если ДанныеСобытия.Element.id = "TradeButton" Тогда 
		
		ИнициализацияЗаморскойТорговли();
		
	ИначеЕсли СтрЗаканчиваетсяНа(ДанныеСобытия.Element.id, "Cross") Тогда
		НажатиеНаВершинуСервер(ДанныеСобытия.Element.id);
		ЗаменитьВершинуНаПоселение(ДанныеСобытия.Element.id);
		
	ИначеЕсли СтрЗаканчиваетсяНа(ДанныеСобытия.Element.id, "CrossSettlement") Тогда
		НажатиеНаПоселениеСервер(ДанныеСобытия.Element.id);
		ЗаменитьПоселениеНаГород(ДанныеСобытия.Element.id);
		
	ИначеЕсли СтрЗаканчиваетсяНа(ДанныеСобытия.Element.id, "Road") Тогда
		НажатиеНаРеброСервер(ДанныеСобытия.Element.id);
		ЗаменитьРеброНаДорогу(ДанныеСобытия.Element.id);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОбъектСтроительства (Код)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Строительство.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Строительство КАК Строительство
	|ГДЕ
	|	Строительство.Код = &Код";
	
	
	Запрос.УстановитьПараметр("Код", Код);
	РезультатЗапросаСтроителства = Запрос.Выполнить();
	
	Выборка = РезультатЗапросаСтроителства.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Ссылка;
	
КонецФункции

&НаСервере
Процедура СоздатьНовуюЗаписьВСтатусыПерекрестки(СсылкаНаОбъект, Игрок, СсылкаНаПерекресток)
	
	НоваяЗапись = РегистрыСведений.СтатусыПерекрестков.СоздатьМенеджерЗаписи();
	
	НоваяЗапись.Перекресток =  СсылкаНаПерекресток;
	НоваяЗапись.Прочитать();
	
	Если НоваяЗапись.Выбран() = Ложь Тогда
		
		НоваяЗапись.Перекресток =  СсылкаНаПерекресток;
		НоваяЗапись.Объект = СсылкаНаОбъект;
		НоваяЗапись.Игрок = Игрок;
		
	Иначе	
		
	КонецЕсли;
	
	НоваяЗапись.Записать();	
КонецПроцедуры


#Область Работы_с_вершинами
&НаСервере
Процедура НажатиеНаВершинуСервер(Вершина)
		
	СтрокаПоиска = СтрЗаменить(Вершина, "Cross", "");
	Перекресток = Справочники.Перекрестки.НайтиПоКоду(СтрокаПоиска, Истина);
	СсылкаНаОбъект = ПолучитьОбъектСтроительства(2);
	СоздатьНовуюЗаписьВСтатусыПерекрестки(СсылкаНаОбъект, ОбщийМодульСервер.ПолучитьТекущегоИгрока(), Перекресток);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьВершинуНаПоселение(НайденнаяВершина)
	
	Элемент = Элементы.ИгровоеПоле.Документ.getElementById(НайденнаяВершина);
	Элемент.className = Элемент.className + " settlement " + ЦветаСтруктура[ЦветИгрока];
	Элемент.id = Элемент.id + "Settlement"; 
	
КонецПроцедуры 
#КонецОбласти

#Область Работа_с_поселениями
&НаСервере
Процедура НажатиеНаПоселениеСервер(Поселение)
		
	СтрокаПоиска = СтрЗаменить(Поселение, "CrossSettlement", "");
	Перекресток = Справочники.Перекрестки.НайтиПоКоду(СтрокаПоиска, Истина);
	СсылкаНаОбъект = ПолучитьОбъектСтроительства(3);
	
	СоздатьНовуюЗаписьВСтатусыПерекрестки(СсылкаНаОбъект, ОбщийМодульСервер.ПолучитьТекущегоИгрока(), Перекресток);

КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьПоселениеНаГород(НайденноеПоселение) 
	
	Элемент = Элементы.ИгровоеПоле.Документ.getElementById(НайденноеПоселение);
	Элемент.className = Элемент.className + "City";
	Элемент.id = СтрЗаменить(Элемент.id, "Settlement", "City");
		
КонецПроцедуры
#КонецОбласти

#Область Работа_с_ребрами
&НаСервере
Процедура НажатиеНаРеброСервер(Ребро)
	
	 СтрокаПоиска = СтрЗаменить(Ребро, "Road", "");
	 Путь = Справочники.Пути.НайтиПоНаименованию(СтрокаПоиска, Истина);
	 СоздатьНовуюЗаписьВСтатусыПути(ОбщийМодульСервер.ПолучитьТекущегоИгрока(), Путь);
	 
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьРеброНаДорогу(Ребро)
	
	Для Каждого Цвет из ЦветаСтруктура Цикл
		
		Если Цвет.Ключ = ЦветИгрока Тогда
			
			Элементы.ИгровоеПоле.Документ.getElementById(Ребро).style.background = Цвет.Значение;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьНовуюЗаписьВСтатусыПути(Игрок, СсылкаНаПуть)
	
	НоваяЗапись = РегистрыСведений.СтатусыПути.СоздатьМенеджерЗаписи();
	НоваяЗапись.Путь =  СсылкаНаПуть;
	НоваяЗапись.Игрок = Игрок;
	НоваяЗапись.Записать();
	
КонецПроцедуры
#КонецОбласти
#КонецОбласти


//Работа с заморской торговлей
&НаСервере
Процедура ИнициализацияЗаморскойТорговли()
	
	ИнициализацияКартинокЗаморскойТорговли();
	
	Элементы.ВсеСтраницы.ТекущаяСтраница = Элементы.СтраницаЗаморскойТорговли;
	
КонецПроцедуры 

&НаСервере
Процедура ИнициализацияКартинокЗаморскойТорговли()          
	
	ЗаморскаяТорговляХТМЛ = СтрЗаменить(ЗаморскаяТорговляХТМЛ, "%ФонЗаморскойТорговли%", ФонЗаморскаяТорговляАдрес);
	ЗаморскаяТорговляХТМЛ = СтрЗаменить(ЗаморскаяТорговляХТМЛ, "%Глина%", ГлинаАдрес);
	ЗаморскаяТорговляХТМЛ = СтрЗаменить(ЗаморскаяТорговляХТМЛ, "%Камень%", КаменьАдрес);
	ЗаморскаяТорговляХТМЛ = СтрЗаменить(ЗаморскаяТорговляХТМЛ, "%Пшеница%", ПшеницаАдрес);
	ЗаморскаяТорговляХТМЛ = СтрЗаменить(ЗаморскаяТорговляХТМЛ, "%Овца%", ОвцаАдрес);
	ЗаморскаяТорговляХТМЛ = СтрЗаменить(ЗаморскаяТорговляХТМЛ, "%Древесина%", ДревесинаАдрес);
	ЗаморскаяТорговляХТМЛ = СтрЗаменить(ЗаморскаяТорговляХТМЛ, "%Любой%", ЛюбойАдрес);
	
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗаморскаяТорговляПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Если ДанныеСобытия.Element.id = "Back" Тогда 	
		Элементы.ВсеСтраницы.ТекущаяСтраница = Элементы.СтраницаИгровогоПоля;
	ИначеЕсли ДанныеСобытия.Element.id = "ClayMy" Тогда 
		Элементы.ЗаморскаяТорговля.Документ.getElementById("OfferResource").src = ГлинаАдрес;
		
	ИначеЕсли ДанныеСобытия.Element.id = "ClayYour" Тогда 
		Элементы.ЗаморскаяТорговля.Документ.getElementById("ReceiveResource").src = ГлинаАдрес;
		
	ИначеЕсли ДанныеСобытия.Element.id = "RockMy" Тогда
		Элементы.ЗаморскаяТорговля.Документ.getElementById("OfferResource").src = КаменьАдрес;
		
	ИначеЕсли ДанныеСобытия.Element.id = "RockYour" Тогда
		Элементы.ЗаморскаяТорговля.Документ.getElementById("ReceiveResource").src = КаменьАдрес; 
		
	ИначеЕсли ДанныеСобытия.Element.id = "SheepMy" Тогда
		Элементы.ЗаморскаяТорговля.Документ.getElementById("OfferResource").src = ОвцаАдрес;	 
		
	ИначеЕсли ДанныеСобытия.Element.id = "SheepYour" Тогда
		Элементы.ЗаморскаяТорговля.Документ.getElementById("ReceiveResource").src = ОвцаАдрес;
		
	ИначеЕсли ДанныеСобытия.Element.id = "WoodMy" Тогда
		Элементы.ЗаморскаяТорговля.Документ.getElementById("OfferResource").src = ДревесинаАдрес;	 
		
	ИначеЕсли ДанныеСобытия.Element.id = "WoodYour" Тогда
		Элементы.ЗаморскаяТорговля.Документ.getElementById("ReceiveResource").src = ДревесинаАдрес;
		
	ИначеЕсли ДанныеСобытия.Element.id = "WheatMy" Тогда
		Элементы.ЗаморскаяТорговля.Документ.getElementById("OfferResource").src = ПшеницаАдрес;	 
		
	ИначеЕсли ДанныеСобытия.Element.id = "WheatYour" Тогда
		Элементы.ЗаморскаяТорговля.Документ.getElementById("ReceiveResource").src = ПшеницаАдрес;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИгровоеПолеДокументСформирован(Элемент)
	
	Элементы.ВсеСтраницы.ТекущаяСтраница = Элементы.СтраницаИгровогоПоля;
	РаботаСЛандшафтамиКлиент.ЗаполнитьГексыХТМЛ(Элементы.ИгровоеПоле.Документ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ГлавноеМенюХТМЛ = МакетГлавногоМеню;
КонецПроцедуры
